const sliderText = document.querySelector('.slider-text');
const sliderImage = document.querySelector('.slider-image img');
const prevButton = document.querySelector('.slider-prev');
const nextButton = document.querySelector('.slider-next');
const slides = [
      {
        image: 'Materijal/Licnosti/momcilo.jpg',
        text: 'Решењем Министарства просвете од 28. октобра 1924. године, из Треће мушке гимназије премештен је у Четврту мучку гимназију* професор Момчило Настасијевић (1894 – 1938). Био је већ на путу књижевне афирмације. У то време настајала је његова збирка приповедака Из тамног вилајета, коју ће објавити три године касније. Упоредо са наставничком каријером, стварао је своја дела настала у трагању за „матерњом мелодијом“ – драму Међулушко благо (1927), те збирку песама Пет лирских кругова (1932). Настасијевић је врло предано и савесно обављао своје наставничке дужности, као професор српског (српско-хрватско-словеначког) језика и француског језика. Иначе, породица Настасијевић нераскидиво је везана за Четврту мушку гимназију. Поред Момчила, у овој школи је три деценије, од школске 1927/28. године, па све до пензионисања, физику и математику предавала његова сестра Славка, а ученици ове гимназије били су његова браћа Славомир и Светомир.'
      },
      {
        image: 'Materijal/Licnosti/momcilo.jpg',
        text: 'Момчило Настасијевић је због своје савесности увек одлично оцењиван од стране директора и просветних инспектора, али изгледа да није био много омиљен меу ученицима. Уосталом, као разредни старешина није био склон да попушта својим ученицима, а у уписницама је у карактеристикама био врло оштар и директан. Тако је, рецимо, ученика лазара Стевановић овако окарактерисао: „ Слабе памети, неуредан, аљкав. Улагује се. Није за гимназију.“ А Србољуба Ђурића, упркос похвали за његову интелигенцију, додао је да је „скроз унеравнотежен.“ Имао је Настасијевић, стога, и неколико неприлика са својим ученицима, а највећа је била када су му 1937. године неки ђаци на улазу стана, како стоји у његовој пријави, „ишчупали електрично звонце злонамерно.“'
      },
      {
        image:'Materijal/Licnosti/momcilo.jpg',
        text: 'У свему другоме, Настасијевић ничим није давао повода за реаговање директора или Министарства просвете. Једино се из сачуваних докумената види да је често узимао кредите које увек могао на време да враћа, због чега му је стављана забранан на плату. Први пут се то десило 1930. године, када му је на име дуга Професорској задрузи од плате одбијено 780 динара**. Године 1933. узео је депозит код Главне државне благајне, а исте године стављена му је забрана на две трећине плате за рачун стоваришта „Прибор“, а тај случај је чак доспео на суд. Забрана на плату Настасијевићу је стављена те године и за рачун Задужбинарског одсека Министарства просвете. Године 1935. стављена му је забрана на плату од 800 динара за рачун Професорске задруге. Најзад, забрану на плату Настасијевић је, по налогу Среског суда добио и почетком 1936. године.'
      },
      {
        image:'Materijal/Licnosti/momcilo.jpg',
        text: 'Што се тиче напредовања у слућби, Настасијевић је ишао уходаним путем, и то убрзано, захваљујући својој марљивости и савесности у служби. Године 1928. затражио је унапређење, и већ 23. јануара 1929. године унапређен је у седму чиновничку групу. Већ почетком 1930. године добио је ново унапређење, а само месец дана касније добио је „прекоредно унапређење због изузетног залагања у раду“. До следећег унапређења прошло је три године. Настасијевић је 13. фебруара 1933. године Министарству просвете предао молбу за унапређење у пету чиновничку групу. Молба је повољно решена. По правилу, следеће унапређење Настасијевић је могао да тражи тек за три године, али је већ 1. августа 1934. године директор Четврте мушке гимназије предложио Министарству просвете „ да се због одличног и марљивог рада г. Момчило Настасијевић пре рока унапреди у четврту групу.“ Ипак, то није ишло брзо. '
      },
      {
        image:'Materijal/Licnosti/momcilo.jpg',
        text: 'Министарство просвете затражило је да директор Четврте мушке гимназије достави уверење „где је г. М. Настасијевић био за време рата.“ Од тренутка када је директор то уверење послао, прошло је четири месеца, а онда је Настасјевић ванредно унапређен. И управо тада Настасијевић је почео да побољева. И поред тога, редовно је држао наставу. Није забележен ниједан његов захтев за одсуство! То је трајало све до пролећа 1936. године, када је тако тешко оболео да је директор Ристић упутио Министарству просвете допис у коме вели да се мора сумњати да ће Настасијевић уопште остати у животу. Такође је директор и општој државној болници упутио потврду „да је њихов болесник г. Момчило Настасијевић разврстан професор.“ За лечење је Настасијевић узео кредит код Професорске задруге. Због болести и дужег боловања Настасијевић је на крају школске 1936/37. године први пут од Комисије за оцењивање наставника добио лошу оцену рада, на коју се одмах, увређен, жалио.'
      },
      {
        image:'Materijal/Licnosti/momcilo.jpg',
        text: 'Настасијевић је 16. децембра 1937. године замолио Министарство просвете за ново унапређење, али га није дочекао јер је два месеца касније умро. Настасијевићев брат Живорад, академски сликар, известио је 3. марта 1938. године директора Четврте мушке гимназије да је „о свом трошку сахранио свога брата, почившег Момчила Настасијевића, професора ове школе“ и захтевао да му се исплате „посмртне принадлежности мога брата.“ Истог дана, директор гимназије издао је налог Главној државној благајни „за исплату посмртних принадлежности за Момчила Настасијевића, професора четврте групе другог степена, у износу од 3270 динара.“ Тако се, прераном смрћу, окончала, поред књижевне, и наставничка каријера Момчила Настасијевића.'
      }
    ];
    
let currentSlide = 0;

// Display initial slide
sliderText.innerHTML = `
  <p>${slides[currentSlide].text}</p>
`;
sliderImage.src = slides[currentSlide].image;

// Handle previous button click
prevButton.addEventListener('click', () => {
  currentSlide--;
  if (currentSlide < 0) {
    currentSlide = slides.length - 1;
  }
  sliderText.innerHTML = `
    <p>${slides[currentSlide].text}</p>
  `;
  sliderImage.classList.add('hidden');
  setTimeout(() => {
    sliderImage.src = slides[currentSlide].image;
    sliderImage.classList.remove('hidden');
  }, 0);
});

// Handle next button click
nextButton.addEventListener('click', () => {
  currentSlide++;
  if (currentSlide > slides.length - 1) {
    currentSlide = 0;
  }
  sliderText.innerHTML = `
    <p>${slides[currentSlide].text}</p>
  `;
  sliderImage.classList.add('hidden');
  setTimeout(() => {
    sliderImage.src = slides[currentSlide].image;
    sliderImage.classList.remove('hidden');
  }, 0);
});

// Handle keyboard arrow keys
document.addEventListener('keydown', (e) => {
  if (e.key === 'ArrowLeft') {
    prevButton.click();
  } else if (e.key === 'ArrowRight') {
    nextButton.click();
  }
});
